# Все что идет после символа # не обрабатывается.
# Это вспомогательный текст.
# Мы используем его для пояснений, указаний или
# демонстрации (как сейчас).


# Задаем данные -----------------------------------------------------------

x = 12.34
y <- 56.78 # обычно используем стрелочку


# Обрабатываем ------------------------------------------------------------

x + y # 69.12
x - y # -44.44
x * y # 700.6652 (умножение)
x / y # 0.21733  (деление)
sqrt(x) # 3.512834 (квадратный корень, square root)
log(y, base = 10) # 1.754195 (логарифм, по основанию 10)

12,34  # ошибка
sqrt() # ошибка


# Задаем столбец / строку -------------------------------------------------

xs <- c(1, 2, 3, 9, 42)

sum(xs)    # 57
mean(xs)   # 11.4
median(xs) # 3
quantile(xs, probs = 3 / 4) # 9


# Задаем таблицу (датафрейм) ----------------------------------------------

data <- data.frame(
  x = c(1, 2, 3, 9, 42),
  y = c(1, 4, 6, 18, 84),
  z = c(1, 6, 9, 27, 126)
)

print(data)

#    x  y   z
# 1  1  1   1
# 2  2  4   6
# 3  3  6   9
# 4  9 18  27
# 5 42 84 126

print(data$x) # 1  2  3  9 42
print(data$y) # 1  4  6 18 84


# Импортируем данные ------------------------------------------------------

data <- readxl::read_excel("01-data.xlsx")

print(data)

#       x     y     z
#   <dbl> <dbl> <dbl>
# 1     1     1     1
# 2     2     4     6
# 3     3     6     9
# 4     9    18    27
# 5    42    84   126

