# Плохие данные 1 ---------------------------------------------------------

data <- readxl::read_excel("02-bad-data-1.xlsx")

print(data)


# Плохие данные 2 ---------------------------------------------------------

data <- readxl::read_excel("02-bad-data-2.xlsx")

print(data)

data$`First value`
data$`Исход, 0 - жив, 1 - умер`
data$analysis_date...6


# Плохие данные 3 ---------------------------------------------------------

data <- readxl::read_excel("02-bad-data-3.xlsx")

print(data)

data$num1
mean(data$num1)

data$num2
mean(data$num2) # NA


# Число (numeric) ---------------------------------------------------------

1      # 1
1.23   # 1.23
1 / 3  # 0.3333333
-1.23  # -1.23


# Логическое (logical) ----------------------------------------------------

# 1 и 0 не являются логическими значениями - это числа

TRUE
FALSE


# Строка (character) ------------------------------------------------------

"Это текст в двойных кавычках"
'Или в одинарных'
"Частичный ответ после МРТ на 01.02.2003 по месту жительства"
c("ЧО", "ПО")


# Категория (factor) ------------------------------------------------------

factor(
  c("ЧО", "ПО", "Частичный ответ"),
  levels = c("СЗ", "ЧО", "ПО")
)

# ЧО   ПО   <NA>
# Levels: СЗ ЧО ПО


# Not Available (неизвестные значения) ------------------------------------

NA
NA + 1           # NA
(NA + 1 + 1) / 3 # NA


# Дата --------------------------------------------------------------------

as.Date("2025-04-18")      # "2025-04-18"
as.Date("2025-04-18") + 30 # "2025-05-18


# Нормальный Excel --------------------------------------------------------

data <- readxl::read_excel("02-good-data.xlsx")

print(data)

mean(data$num1) # 2.243333
mean(data$num2) # NA
mean(data$num3) # 1.936667

data$res_type

data$res_type <- factor(data$res_type, c("СЗ", "ЧО", "ПО"))
data$res_type


# summary -----------------------------------------------------------------

summary(data)
str(data)
